#===================================================================================================================
#                                                 BIBLIOTECAS
#===================================================================================================================

from colorama import init, Fore, Style                   #colorir terminal 
init(autoreset=True)                                     #inicializa o colorama e evita que ele continue após o print

import mysql.connector                                  #banco de dados

#===================================================================================================================
#                                                 FUNÇOES
#===================================================================================================================

# PRINTS DE MENSAGENS POR TIPO/COR (SUCESSO, ERRO E ALERTA)

def sucesso (texto):
    print(Style.BRIGHT + Fore.GREEN + "✅ SUCESSO:  " + texto)

def erro (texto):
    print(Style.BRIGHT + Fore.RED + "❌ ERRO:  " + texto)

def alerta (texto):
    print(Style.BRIGHT + Fore.YELLOW + "⚠️  ALERTA:  " + texto)

#===================================================================================================================
#                                          CONEXAO COM BANCO DE DADOS
#===================================================================================================================

conexao = mysql.connector.connect (
    host = "localhost",
    port = 3306,
    user = "root",
    password = "1234",
    database = "bd_ladpy"
)

if conexao.is_connected():
    sucesso("Banco conectado com sucesso!")

#===================================================================================================================
#                                                 INICIO
#===================================================================================================================

print(f"""
{Fore.CYAN}{Style.BRIGHT}
██╗      █████╗ ██████╗    ██████╗ ██╗   ██╗
██║     ██╔══██╗██╔══██╗   ██╔══██╗╚██╗ ██╔╝
██║     ███████║██║  ██║   ██████╔╝ ╚████╔╝ 
██║     ██╔══██║██║  ██║   ██╔═══╝   ╚██╔╝  
███████╗██║  ██║██████╔╝██╗██║        ██║   
╚══════╝╚═╝  ╚═╝╚═════╝ ╚═╝╚═╝        ╚═╝   
{Fore.GREEN}{Style.BRIGHT}
 █▓▒▒░░░ SISTEMA DE VOTAÇÃO DIGITAL ░░░▒▒▓█

""")